{
    "Potato___Late_blight": "Plant resistant cultivars when available. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation. Destroy all tomato and potato debris after harvest",
    "Tomato___Septoria_leaf_spot" : "Remove infected leaves immediately, and be sure to wash your hands and pruners thoroughly before working with uninfected plants. Fungicides containing either copper or potassium bicarbonate will help prevent the spreading of the disease. Begin spraying as soon as the first symptoms appear and follow the label directions for continued management. While chemical options are not ideal, they may be the only option for controlling advanced infections. One of the least toxic and most effective is chlorothalonil (sold under the names Fungonil and Daconil).",
    "Pepper,_bell___Bacterial_spot": "Seed treatment with sodium hypochlorite (for example, Clorox) is effective in reducing bacterial populations on seed surfaces. Control of bacterial spot on greenhouse transplants is an essential step for preventing spread of the leaf spot bacteria in the field. Transplants should be inspected regularly to identify symptomatic seedlings. Transplants with symptoms may be removed and destroyed or treated with streptomycin. Products containing microorganisms can be used to enhance plant growth and reduce the negative effects of diseases. These products may contain plant-growth-promoting rhizobacteria (PGPR) or biological agents",
    "Apple___Cedar_apple_rust": "cedar-apple rust, plant disease that primarily affects eastern red cedar (Juniperus virginiana) and various apple and crabapple species (genus Malus) in North America and that is caused by the fungus Gymnosporangium juniperi-virginianae. Both hosts, the junipers and the apples, are required for completion of the rust fungus’s two-year life cycle. The disease can be controlled by eradicating either host in a given area or by timely application of a fungicide, in spring for junipers and in summer for apples. Cedar-quince rust, caused by G. clavipes, and cedar-hawthorn rust, due to G. globosum, are similar diseases that infect junipers and various members of the rose family.",
    "Cherry_(including_sour)___Powdery_mildew":"While leaf scorch on strawberry plants can be frustrating, there are some strategies which home gardeners may employ to help prevent its spread in the garden. The primary means of strawberry leaf scorch control should always be prevention.",
    "Corn_(maize)___Northern_Leaf_Blight":"Large, usually oval, grey or light brown leaf spots, sometimes with dark margins, 25-150 mm long (Photos 1&2). The spots merge covering large parts of the leaves. Symptoms occur first on the lower leaves, except when plants become infected by large numbers of spores from the atmosphere. In moist weather, brown fungal growth containing spores occurs on the spots, often in concentric zones. The disease causes the leaves to dry out, wither and die. Spread occurs as spores carried in rain splash and air currents to new plantings (Diagram). Large storms can carry the spores over long distances. Survival is on plant remains - leaves, husks, and other plant parts - as fungal growth and spores. Thick walled spores ('chlamydospores') are produced, allowing survival of the fungus for up to 2 years. Survival also occurs on 'volunteer' plants. There is no evidence that it is seedborne, although it is in sorghum.",
    "Grape___Black_rot":"Black rot, caused by the fungus Guignardia bidwellii, is a serious disease of cultivated and wild grapes. The disease is most destructive in warm, wet seasons. It attacks all green parts of the vine – leaves, shoots, leaf and fruit stems, tendrils, and fruit. The most damaging effect is to the fruit. Note: Guignardia bidwellii forma parthenocissi causes a leaf spot on Boston ivy and Virginia creeper. Control is as for black rot of grapes. Warm, muggy weather in the spring and summer, along with unsprayed fruit of susceptible varieties, may cause fruit to become almost completely rotted by harvest time. Black rot is not difficult to control if good cultural practices are followed along with the use of protective fungicide sprays.",
    "Peach___Bacterial_spot":"Bacterial spot is an important disease of peaches, nectarines, apricots, and plums caused by Xanthomonas campestris pv. pruni. Symptoms of this disease include fruit spots, leaf spots, and twig cankers. Fruit symptoms include pitting, cracking, gumming, and watersoaked tissue, which can make the fruit more susceptible to brown rot, rhizopus, and other fungal infections. Severe leaf spot infections can cause early defoliation. Severe defoliation can result in reduced fruit size, and sunburn and cracking of fruit. Early defoliated trees are reduced in vigor and winter hardiness. Fruit symptoms of bacterial spot may be confused with peach scab, caused by the fungus Cladosporium carpophyllium, however scab spots are more circular, have a dark brown/greenish, fuzzy appearance, and do not pit the fruit surface, although skin cracking can occur. Scab does not cause leaf symptoms but can cause spots on twigs. Initial fruit spots of bacterial spot may be superficial but develop into craters. Leaf symptoms of bacterial spot on peaches and nectarines are generally dark, small lesions, often clustered at the leaf tip where water collects during dews and rain. Leaf tissue around lesions can turn yellow.",
    "Strawberry___Leaf_scorch":"While leaf scorch on strawberry plants can be frustrating, there are some strategies which home gardeners may employ to help prevent its spread in the garden. The primary means of strawberry leaf scorch control should always be prevention.",
}